In [1]:
import numpy as np
import pandas as pd

In [2]:
dataset = pd.read_csv('binary.csv')

In [3]:
dataset.head()

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  800  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

1.a

In [5]:
dataset.dtypes

admit      int64
gre        int64
gpa      float64
rank       int64
dtype: object

In [6]:
dataset[dataset['rank']==1]['gpa'].mean()

3.453114754098361

1.b

In [10]:
dataset[dataset['rank']!=4]['rank'].value_counts()

2    151
3    121
1     61
Name: rank, dtype: int64

1.c

In [12]:
dataset[dataset['rank']==2]['gre'].max()

800

1.d

In [14]:
dataset[dataset['rank']!=1]['gpa'].mean()

3.378525073746315

1.e

In [15]:
np.percentile(dataset['gre'], 10)

440.0

In [16]:
np.percentile(dataset['gpa'], 10)

2.9

1.f

In [17]:
dataset.sort_values(by='gpa')

     admit  gre   gpa  rank
289      0  420  2.26     4
372      1  680  2.42     1
40       0  560  2.42     2
48       0  440  2.48     4
156      0  560  2.52     2
..     ...  ...   ...   ...
377      1  800  4.00     2
165      0  700  4.00     1
70       0  640  4.00     3
252      1  520  4.00     2
310      0  560  4.00     3

[400 rows x 4 columns]

1.g

In [18]:
dataset[dataset['rank']==1]['gpa'].max()

4.0

1.h

In [19]:
dataset.shape

(400, 4)

1.i

In [20]:
dataset['sum'] = dataset['gpa']+dataset['gre']

In [21]:
dataset.head()

   admit  gre   gpa  rank     sum
0      0  380  3.61     3  383.61
1      1  660  3.67     3  663.67
2      1  800  4.00     1  804.00
3      1  640  3.19     4  643.19
4      0  520  2.93     4  522.93

1.j

In [22]:
dataset[dataset['admit']==1].to_csv('binary_with_admit_1.csv')

1.k

In [25]:
dataset[(dataset['rank']==1)&(dataset['admit']==1)].count()

admit    33
gre      33
gpa      33
rank     33
sum      33
dtype: int64